# MatchlineBottomPlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MatchlineBottomPlane Property
ParameterTypeId Class See Also
---
"Bottom Constraint"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MatchlineBottomPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MatchlineBottomPlane As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MatchlineBottomPlane {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace